app/Actions/CreateOrderAction.php

    public function create(int $reference, array $data): Order
    {
        $order = new Order();
        $order->status = 'CREATED';
        $order->reference = $reference;
        $order->customerName = $data['name'];
        $order->customerDocument = $data['document'];
        $order->customerEmail = $data['email'];
        $order->customer()->associate(auth()->user()->id);
        $order->save();
---
insert into `orders` (`status`, `reference`, `customerName`, `customerDocument`, `customerEmail`, `customer_id`, `updated_at`, `created_at`) values ('CREATED', 964416, 'Leidy Catherine Benavides Muñoz', '1083917062', 'leidy@gmail.com', 1, '2022-03-30 04:05:51', '2022-03-30 04:05:51')