app/Actions/Admin/Products/CreateNewProduct.php

    public function create(array $input): Product
    {
        /***Validator::make($input, [
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:users'],
            'password' => $this->passwordRules(),
            'terms' => Jetstream::hasTermsAndPrivacyPolicyFeature() ? ['required', 'accepted'] : '',
        ])->validate();**/
        $product = new Product();

        $product->name =  $input['name'];
        $product->code = $input['code'];
        $product->price = $input['price'];
        $product->description = $input['description'];
        $product->stock = $input['stock'];
        //$product->discount = $input['discount'];
        $product->status = $input['status'];
        //$product->file = $input['file'];
        $product->save();
---
insert into `products` (`name`, `code`, `price`, `description`, `stock`, `status`, `category_id`, `user_id`, `updated_at`, `created_at`) values ('kepler', '232342', '135000', '<p>kkkkkkkkkkkkkkkkkkkkk</p>', '2', '1', '1', '1', '2022-03-29 14:46:08', '2022-03-29 14:46:08')