routes/web.php

use Illuminate\View\View;


Route::get('/', function (){
    $categories = Category::all();
    return view('welcome', compact('categories'));
})->name('welcome');
---
select * from `categories`