app/Http/Livewire/Admin/ProductIndex.php

    public function render()
    {
        $products = Product::where('user_id', auth()->user()->id)
            ->where('name', 'LIKE', '%' . $this->search . '%')
            ->latest('id')
            ->paginate();
---
select * from `products` where `user_id` = 1 and `name` LIKE '%%' order by `id` desc limit 15 offset 0
select count(*) as aggregate from `products` where `user_id` = 1 and `name` LIKE '%%'