app/Http/Controllers/PaymentController.php

    public static function consult(int $id)
    {
        if (isset($id)) {
            $order = Order::where('id', $id)->first();
        } else {
            $order = Order::latest()->first();
---
select * from `orders` order by `created_at` desc limit 1