app/Http/Controllers/PaymentController.php

update `orders` set `status` = 'APPROVED', `orders`.`updated_at` = '2022-03-29 22:38:57' where `id` = 11
---
    public function cancel(Order $order): RedirectResponse
    {
        $orderCancel = Order::select('id', 'status')
            ->where('id', $order->id)->first();

        $orderCancel->status = OrderStatus::REJECTED;
        $orderCancel->save();

        ConsultPaymentStatusAction::updateOrderRejected($order);