app/Http/Controllers/ProductController.php

select * from `products` where `status` = 1 order by `id` desc limit 8 offset 0
---
    public function index(): View
    {
        $products = Product::where('status', true)->paginate();