app/Http/Controllers/ProductController.php

select * from `categories`
---
    public function index(): View
    {
        if(request()->page){
            $key = 'products' . request()->page;
        }
        else{
            $key = 'products';
        }

        if (Cache::has($key)) {
            $products = Cache::get($key);
        }
        else{
            $products = Product::where('status', true)
            //->where('user_id', auth()->user()->id)
            ->latest('id')
            ->paginate(20);
            Cache::put($key, $products);
        }

        $categories = Category::all();

select * from `categories`
---
    public function showByCategory(Category $category): View
    {
        $categories = Category::all();