app/Http/Controllers/ProductController.php

    public function index(): View
    {
        if (request()->page) {
            $key = 'products' . request()->page;
        } else {
            $key = 'products';
        }

        if (Cache::has($key)) {
            $products = Cache::get($key);
        } else {
            $products = Product::where('status', true)
            ->latest('id')
            ->paginate(16);
---
select count(*) as aggregate from `products` where `status` = 1

    public function showByCategory(Category $category): View
    {
        $categories = Category::select('id', 'name')->get();

        $products = Product::where('category_id', $category->id)
            ->where('status', true)
            ->paginate(9);
---
select * from `products` where `category_id` = 8 and `status` = 1 limit 9 offset 0
select count(*) as aggregate from `products` where `category_id` = 8 and `status` = 1