app/Http/Controllers/ShoppingCartController.php

    public function store(Request $request): RedirectResponse
    {
        //dd($request->id);
        $product = Product::whereId($request->id)->first();
        //Cart::add(['id' => '293ad', 'name' => 'Product 1', 'qty' => 1, 'price' => 9.99, 'options' => ['size' => 'large']]);
        Cart::add($product->id, $product->name, 1, $product->price, [
            'url' => $product->images->first()->url,
            'code' => $product->code,
            'discount' => $product->discount,
            'stock' => $product->stock,
        ]);
---
select * from `products` where `id` = '19' limit 1
select * from `images` where `images`.`product_id` = 19 and `images`.`product_id` is not null