app/Services/Payments/PlacetoPay/PlacetoPay.php

    public function __construct()
    {
        $this->items = Cart::content(auth()->user()->id);
        $this->reference = Order::latest()->first()->reference + 1;
---
select * from `orders` order by `created_at` desc limit 1