app/Http/Controllers/Admin/ProductController.php

select * from `products` where `user_id` = 1 order by `id` desc limit 5 offset 0
select count(*) as aggregate from `products` where `user_id` = 1
---
    public function index(): View
    {
        //se puede pasar a un scope
        $products = Product::where('user_id', auth()->user()->id)
            ->latest('id')
            ->paginate(5);

select `name`, `id` from `categories`
---
    public function create(): View
    {
        $categories = Category::pluck('name', 'id');